#include "QvorovMainFrame.h"

QvorovMainFrame::QvorovMainFrame() :
	biographyButton({ 50, 50, 200, 50 }, "Биография", GRAY,
	std::string("Пейо Яворов (истинско име Пейо Тотев Крачолов) е един от най-значимите \n ") +
	" български поети и дейци на националноосвободителното движение в Македония. \n " +
	"Роден е на 1 януари 1878 г.в Чирпан, а умира на 29 октомври 1914 г.в София. \n" +
	"\n" +
	"Яворов започва творческия си път под влияние на реализма, но по-късно се \n " +
	"утвърждава като един от водещите представители на българския символизъм. \n" +
	"Сред най-известните му произведения са стихосбирките „Подир сенките на \n" +
	"облаците“ и „Безсъници“, както и драмите „В полите на Витоша“ и „Когато гръм \n" +
	"удари, как ехото заглъхва“. \n " +
	"\n" +
	"Освен поет, той е и активен участник в борбите за освобождение на Македония \n" +
	"като член на Вътрешна македоно-одринска революционна организация, където \n" +
	"работи с личности като Гоце Делчев. \n" +
	"\n" +
	"Личният му живот е белязан от драматични събития, включително трагичната \n" +
	"смърт на съпругата му Лора Каравелова, което силно повлиява върху \n" +
	"творчеството и съдбата му. Яворов остава в историята като поет на дълбоките \n" +
	"чувства, любовта и трагизма.")
{}

void QvorovMainFrame::runVisuals()
{
	biographyButton.draw();
}

void QvorovMainFrame::runMath() {
	biographyButton.run();
}